Tekla.Structures.ModelInternal.CoTaskMem`1
This class is used to ensure that memory allocated using AllocCoTaskMeme
to hold a list of struct instances is released properly.
A struct type.

Tekla.Structures.ModelInternal.CoTaskMem`1.#ctor(System.Collections.Generic.List{`0}@)
Initializes a new instance of the Tekla.Structures.ModelInternal.CoTaskMem`1> class.
pList: A list of objects of type T.

Tekla.Structures.ModelInternal.CoTaskMem`1.Dispose
Disposes the object

Tekla.Structures.ModelInternal.CoTaskMem`1.GetPointer
Gets an unsafe pointer to the allocated memory.
Returns: